src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЦентральныеСерверы</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Кластеры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает ссылку на кластер центрального сервера с заданным именем.
// Если кластер не существует - создает его.
// Если кластер существует, но имеет признак Скрыть и параметр ПоказыватьСкрытые=Ложь - возвращает пустую ссылку.
//
// Параметры:
//  ЦентральныйСервер - СправочникСсылка.ЦентральныеСерверы
//  ИмяКластера - Строка
//  ПоказыватьСкрытые - Булево
//
// Возвращаемое значение:
//  СправочникСсылка.Кластеры - Ссылка на существующий или созданный кластер
//
Функция ПолучитьИлиСоздатьКластер(ЦентральныйСервер, ИмяКластера, ПоказыватьСкрытые) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Кластеры.Ссылка КАК Ссылка,
	|	Кластеры.Скрыть КАК Скрыть
	|ИЗ
	|	Справочник.Кластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Владелец = &ЦентральныйСервер
	|	И Кластеры.Имя = &ИмяКластера
	|	И Кластеры.ПометкаУдаления = ЛОЖЬ
	|	И Кластеры.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("ЦентральныйСервер", ЦентральныйСервер);
	Запрос.УстановитьПараметр("ИмяКластера", ИмяКластера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Скрыть И НЕ ПоказыватьСкрытые Тогда
			Возврат ПустаяСсылка();
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		НовыйКластер = СоздатьЭлемент();
		НовыйКластер.Владелец = ЦентральныйСервер;
		НовыйКластер.Имя = ИмяКластера;
		НовыйКластер.Наименование = СтрШаблон("%1\%2", Строка(ЦентральныйСервер), ИмяКластера);
		НовыйКластер.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;		
		НовыйКластер.Записать();
		Возврат НовыйКластер.Ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти
 
#КонецЕсли
